https://www.datacamp.com/community/tutorials/pandas-tutorial-dataframe-python

Reshaping
http://nikgrozev.com/2015/07/01/reshaping-in-pandas-pivot-pivot-table-stack-and-unstack-explained-with-pictures/

In [109]:
import pandas as pd
import numpy as np

In [110]:
df = pd.DataFrame(np.random.randint(low=0, high=10, size=(5, 5)), columns=['a', 'b', 'c', 'd', 'e'])
df

   a  b  c  d  e
0  9  6  9  5  0
1  7  5  6  7  6
2  6  1  1  7  1
3  0  9  9  4  4
4  5  0  6  8  0

In [111]:
df2 = pd.DataFrame((np.linspace(start=0, stop=29, num=30).reshape(5,6)), columns=['a', 'b', 'c', 'd', 'e', 'f'])
df2

      a     b     c     d     e     f
0   0.0   1.0   2.0   3.0   4.0   5.0
1   6.0   7.0   8.0   9.0  10.0  11.0
2  12.0  13.0  14.0  15.0  16.0  17.0
3  18.0  19.0  20.0  21.0  22.0  23.0
4  24.0  25.0  26.0  27.0  28.0  29.0

In [112]:
df*df2

       a      b      c      d     e   f
0    0.0    6.0   18.0   15.0   0.0 NaN
1   42.0   35.0   48.0   63.0  60.0 NaN
2   72.0   13.0   14.0  105.0  16.0 NaN
3    0.0  171.0  180.0   84.0  88.0 NaN
4  120.0    0.0  156.0  216.0   0.0 NaN

In [113]:
print('Zeile:')
print(df.iloc[0])
print('Einzelnes Element:')
print(df.iloc[0]['a'])
print('Spalte')
print(df.loc[:,'a'])
print('Bereich:')
print(df.loc[1:3,'a':'c'])

Zeile:
a    9
b    6
c    9
d    5
e    0
Name: 0, dtype: int64
Einzelnes Element:
9
Spalte
0    9
1    7
2    6
3    0
4    5
Name: a, dtype: int64
Bereich:
   a  b  c
1  7  5  6
2  6  1  1
3  0  9  9

In [117]:
exclude = [1,3]
all_columns = range(df.columns.values.size)
columns = [x for x in all_columns if x not in exclude]

df.iloc[:, columns]

   a  c  e
0  9  9  0
1  7  6  6
2  6  1  1
3  0  9  4
4  5  6  0

In [115]:
all_columns

range(0, 5)

In [8]:
df.loc[1, 'b']

7

In [9]:
df.loc[1, ['a','b']]

a    0
b    7
Name: 1, dtype: int64

In [10]:
df['a']

0    7
1    0
2    8
3    1
4    8
Name: a, dtype: int64

In [11]:
df[['a', 'b']]

   a  b
0  7  6
1  0  7
2  8  7
3  1  8
4  8  9

In [39]:
condition_and = (df['a'] > 3) & (df['b'] > 5)
print(condition_and)
df[condition_and]

0    False
1     True
2     True
3     True
4    False
dtype: bool

   a  b  c  d  e
1  5  6  6  9  7
2  5  6  9  8  0
3  8  9  8  6  2

In [13]:
condition_or = (df['a'] == 1) | (df['a'] == 2)
df[condition_or]

   a  b  c  d  e
3  1  8  3  8  3

In [50]:
df.columns

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [51]:
#columns_all = ['a', 'b', 'c', 'd', 'e'] 

#oder auch
columns_all = df.columns
df[columns_all]

   a  b  c  d  e
0  8  4  6  6  3
1  5  6  6  9  7
2  5  6  9  8  0
3  8  9  8  6  2
4  3  2  9  1  8

In [52]:
columns_without_b = list(filter(lambda x: x != 'c', columns_all))
print(columns_without_b)
df[columns_without_b]

['a', 'b', 'd', 'e']

   a  b  d  e
0  8  4  6  3
1  5  6  9  7
2  5  6  8  0
3  8  9  6  2
4  3  2  1  8

In [53]:
def not_b(x):
    return x != 'b'

df[list(filter(not_b, columns_all))]

   a  c  d  e
0  8  6  6  3
1  5  6  9  7
2  5  9  8  0
3  8  8  6  2
4  3  9  1  8

In [126]:
columns_except = ['a', 'e']
df[list(filter(lambda x: x not in columns_except, columns_all))]

   b  c  d
0  8  9  6
1  9  4  7
2  7  5  4
3  7  8  7
4  5  4  5

In [91]:
df_copy = df.copy()
df_copy

   a  b  c  d  e
0  1  8  8  7  0
1  4  1  8  3  5
2  0  2  8  7  7
3  4  8  1  8  1
4  7  8  5  7  7

In [92]:
{'0': 7}
df_copy['f'] = {0: 7, 5: 3, 2: 5, 3: 9, 4: 2} #[4, 9, 1, 4, 5]
df_copy

   a  b  c  d  e  f
0  1  8  8  7  0  0
1  4  1  8  3  5  5
2  0  2  8  7  7  2
3  4  8  1  8  1  3
4  7  8  5  7  7  4

In [93]:
df_copy

   a  b  c  d  e  f
0  1  8  8  7  0  0
1  4  1  8  3  5  5
2  0  2  8  7  7  2
3  4  8  1  8  1  3
4  7  8  5  7  7  4

In [96]:
df.applymap(lambda x: x * 3)

    a   b   c   d   e
0   3  24  24  21   0
1  12   3  24   9  15
2   0   6  24  21  21
3  12  24   3  24   3
4  21  24  15  21  21

In [98]:
df['a'].map(lambda x: x * 5)

0     5
1    20
2     0
3    20
4    35
Name: a, dtype: int64

In [99]:
df

   a  b  c  d  e
0  1  8  8  7  0
1  4  1  8  3  5
2  0  2  8  7  7
3  4  8  1  8  1
4  7  8  5  7  7

In [100]:
df * df_copy

    a   b   c   d   e   f
0   1  64  64  49   0 NaN
1  16   1  64   9  25 NaN
2   0   4  64  49  49 NaN
3  16  64   1  64   1 NaN
4  49  64  25  49  49 NaN

In [101]:
df['a']

0    1
1    4
2    0
3    4
4    7
Name: a, dtype: int64

In [106]:
array = np.array(df)

In [107]:
array

array([[1, 8, 8, 7, 0],
       [4, 1, 8, 3, 5],
       [0, 2, 8, 7, 7],
       [4, 8, 1, 8, 1],
       [7, 8, 5, 7, 7]])